DataProcessors/ПодборДокументовДляСчетФактур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПодборДокументовДляСчетФактур</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторФормыВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыПодбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОплаты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
								<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подобрать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/ВозвратТоваровОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВозвратТоваровОтПокупателя</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДС</xr:Item>
				<xr:Item>AccumulationRegister.Запасы</xr:Item>
				<xr:Item>AccumulationRegister.Реализация</xr:Item>
				<xr:Item>AccumulationRegister.МБПСклад</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРасчетов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатратИДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоСписанияСебестоимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатратИДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрСчетУчетаСкидок</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНСП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Comment>Используется для указания суммы скидки на конкретную позицию товара</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДохода</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСебестоимости</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Итого</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОценки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыОценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>предСтатусМБП</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыМБП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндивидуальныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНСП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНСП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ПодборДокументовДляСчетФактур/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.Ссылка) = Тип("ДокументСсылка.СчетФактураВыписанный")  Тогда   
		ПодобратьДокументыДляСФВыписанный(Параметры.Контрагент, Параметры.ДокументВозврата, 
										Параметры.НачалоПериода, Параметры.КонецПериода);
		ВидПодбора = Параметры.ВидПодбора;
		Объект.УникальныйИдентификаторФормыВладельца = Параметры.УникальныйИдентификаторФормыВладельца;
	//ИначеЕсли ТипЗнч(Параметры.Ссылка) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
	//	ПодобратьДокументыДляСФПолученный(Параметры.Контрагент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьДокументыДляСФВыписанный(Контрагент, ДокументВозврата, НачалоПериода, КонецПериода)

	Запрос = Новый Запрос;
	
	Если ДокументВозврата Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ 
			|	ВозвратТоваровОтПокупателя.Ссылка,
			|	ВозвратТоваровОтПокупателя.СуммаДокумента
			|ИЗ
			|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
			|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыписанный КАК СчетФактураВыписанный 
			|		ПО СчетФактураВыписанный.ДокументОснование = ВозвратТоваровОтПокупателя.Ссылка
			|ГДЕ 
			|	ВозвратТоваровОтПокупателя.Контрагент = &Контрагент
			|	И НЕ ВозвратТоваровОтПокупателя.Ссылка = ЕСТЬNULL(СчетФактураВыписанный.ДокументОснование, ЗНАЧЕНИЕ(Документ.ВозвратТоваровОтПокупателя.ПустаяСсылка))
			|	И ВозвратТоваровОтПокупателя.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
			
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РеализацияТоваровУслуг.Ссылка,
			|	РеализацияТоваровУслуг.СуммаДокумента
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|ГДЕ
			|	РеализацияТоваровУслуг.Контрагент = &Контрагент 
			|	И (РеализацияТоваровУслуг.СерияБланкаСФ = """"
			|	ИЛИ РеализацияТоваровУслуг.НомерБланкаСФ = """")
			|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ 
			|	СчетНаОплатуПокупателю.Ссылка,
			|	СчетНаОплатуПокупателю.СуммаДокумента
			|ИЗ
			|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
			|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыписанный КАК СчетФактураВыписанный 
			|		ПО СчетФактураВыписанный.ДокументОснование = СчетНаОплатуПокупателю.Ссылка
			|ГДЕ
			|	СчетНаОплатуПокупателю.Контрагент = &Контрагент
			|	И НЕ СчетНаОплатуПокупателю.Ссылка = ЕСТЬNULL(СчетФактураВыписанный.ДокументОснование, ЗНАЧЕНИЕ(Документ.СчетНаОплатуПокупателю.ПустаяСсылка))
			|	И СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
			//|
			//|ОБЪЕДИНИТЬ ВСЕ
			//|
			//|ВЫБРАТЬ 
			//|	ПередачаОС.Ссылка,
			//|	ПередачаОС.СуммаДокумента
			//|ИЗ
			//|	Документ.ПередачаОС КАК ПередачаОС
			//|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыписанный КАК СчетФактураВыписанный 
			//|		ПО СчетФактураВыписанный.ДокументОснование = ПередачаОС.Ссылка
			//|ГДЕ 
			//|	ПередачаОС.Контрагент = &Контрагент
			//|	И НЕ ПередачаОС.Ссылка = ЕСТЬNULL(СчетФактураВыписанный.ДокументОснование, ЗНАЧЕНИЕ(Документ.ПередачаОС.ПустаяСсылка))";
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
		
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Объект.ДокументыПодбора.Очистить();
	
	Пока Выборка.Следующий() Цикл          	
		СтрокаТабличнойЧасти = Объект.ДокументыПодбора.Добавить();	
		СтрокаТабличнойЧасти.ДокументОплаты = Выборка.Ссылка;
		СтрокаТабличнойЧасти.СуммаДокумента = Выборка.СуммаДокумента;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьДокументыДляСФПолученный(Контрагент)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка,
		|	ПоступлениеТоваровУслуг.СуммаДокумента
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Контрагент = &Контрагент
		|	И (ПоступлениеТоваровУслуг.СерияБланкаСФ = ""
		|	ИЛИ ПоступлениеТоваровУслуг.НомерБланкаСФ = "")	
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратТоваровПоставщику.Ссылка,
		|	ВозвратТоваровПоставщику.СуммаДокумента
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		|ГДЕ
		|	ВозвратТоваровПоставщику.Контрагент = &Контрагент
		|	И (ВозвратТоваровПоставщику.СерияБланкаСФ = ""
		|	ИЛИ ВозвратТоваровПоставщику.НомерБланкаСФ = "")	
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	ДополнительныеРасходы.Ссылка,
		|	ДополнительныеРасходы.СуммаДокумента
		|ИЗ
		|	Документ.ДополнительныеРасходы КАК ДополнительныеРасходы
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный 
		|		ПО СчетФактураПолученный.ДокументОснование = ДополнительныеРасходы.Ссылка
		|ГДЕ 
		|	ДополнительныеРасходы.Контрагент = &Контрагент
		|	И НЕ ДополнительныеРасходы.Ссылка = ЕСТЬNULL(СчетФактураПолученный.ДокументОснование, ЗНАЧЕНИЕ(Документ.ДополнительныеРасходы.ПустаяСсылка))";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
		
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеФлажки(Команда)
	Для каждого СтрокаТабличнойЧасти из Объект.ДокументыПодбора Цикл
		СтрокаТабличнойЧасти.Подобрать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеФлажки(Команда)
	Для каждого СтрокаТабличнойЧасти из Объект.ДокументыПодбора Цикл
		СтрокаТабличнойЧасти.Подобрать = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Закрыть(ЗаписатьПодборВХранилище());
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьПодборВХранилище()
	
	Структура = Новый Структура();
	Структура.Вставить("Подобрать", Истина);
	МассивВозврата = Объект.ДокументыПодбора.НайтиСтроки(Структура);

	АдресКорзиныВХранилище = ПоместитьВоВременноеХранилище(МассивВозврата, Объект.УникальныйИдентификаторФормыВладельца);
	Возврат Новый Структура("АдресКорзиныВХранилище, УникальныйИдентификаторФормыВладельца", АдресКорзиныВХранилище, Объект.УникальныйИдентификаторФормыВладельца);
	
КонецФункции
